In [1]:
import pandas as pd

# Step 1: Read CSV file

In [2]:
df = pd.read_csv('./dataset/drinks.csv', sep='|')

# Step 2: Statistic on each column

In [3]:
print(df.describe())

       beer_servings  spirit_servings  wine_servings  \
count     193.000000       193.000000     193.000000
mean      106.160622        80.994819      49.450777
std       101.143103        88.284312      79.697598
min         0.000000         0.000000       0.000000
25%        20.000000         4.000000       1.000000
50%        76.000000        56.000000       8.000000
75%       188.000000       128.000000      59.000000
max       376.000000       438.000000     370.000000

       total_litres_of_pure_alcohol
count                    193.000000
mean                       4.717098
std                        3.773298
min                        0.000000
25%                        1.300000
50%                        4.200000
75%                        7.200000
max                       14.400000

# Step 3: Drop the column "total_litres_of_pure_alcohol"

In [4]:
df = df.drop(['total_litres_of_pure_alcohol'], axis=1)
df.head(10)

             country  beer_servings  spirit_servings  wine_servings continent
0        Afghanistan              0                0              0        AS
1            Albania             89              132             54        EU
2            Algeria             25                0             14        AF
3            Andorra            245              138            312        EU
4             Angola            217               57             45        AF
5  Antigua & Barbuda            102              128             45       NoA
6          Argentina            193               25            221        SA
7            Armenia             21              179             11        EU
8          Australia            261               72            212        OC
9            Austria            279               75            191        EU

# Step 4: Drop the 3th row and reset index

In [5]:
df = df.drop([2], axis=0)
df = df.reset_index(drop=True)
df.head()

             country  beer_servings  spirit_servings  wine_servings continent
0        Afghanistan              0                0              0        AS
1            Albania             89              132             54        EU
2            Andorra            245              138            312        EU
3             Angola            217               57             45        AF
4  Antigua & Barbuda            102              128             45       NoA

# Step 5: Print row that beer_servings is the biggest  
## hint: df['beer_serving'].idxmax() return  index of max 'beer_serving'

In [6]:
df.iloc[df['beer_servings'].idxmax()]

country            Namibia
beer_servings          376
spirit_servings          3
wine_servings            1
continent               AF
Name: 116, dtype: object

# Step 6: If wine_servings > 100, then set wine_servings value to high. Else set to low

In [7]:
df['wine_servings'] = df['wine_servings'].apply(lambda x: 'high' if x>100 else 'low')
df.head()

             country  beer_servings  spirit_servings wine_servings continent
0        Afghanistan              0                0           low        AS
1            Albania             89              132           low        EU
2            Andorra            245              138          high        EU
3             Angola            217               57           low        AF
4  Antigua & Barbuda            102              128           low       NoA

# Step 7: one-hot encoding column "wine_servings"

In [8]:
df = pd.concat([df,pd.get_dummies(df['wine_servings'], prefix='wine_servings')],axis=1)
df.head()

,country,beer_servings,spirit_servings,wine_servings,continent,wine_servings_high,wine_servings_low
0,Afghanistan,0,0,low,AS,0,1
1,Albania,89,132,low,EU,0,1
2,Andorra,245,138,high,EU,1,0
3,Angola,217,57,low,AF,0,1
4,Antigua & Barbuda,102,128,low,NoA,0,1

# Step 8: Calculate sum of beer_servings

In [9]:
df.groupby('continent').sum()

,beer_servings,spirit_servings,wine_servings_high,wine_servings_low
continent,,,,
AF,3233,866,2,50
AS,1630,2677,1,43
EU,8720,5965,28,17
NoA,3345,3812,0,23
OC,1435,935,2,14
SA,2101,1377,3,9

# Step 9: Write result to CSV file(without index)

In [10]:
df.head()

,country,beer_servings,spirit_servings,wine_servings,continent,wine_servings_high,wine_servings_low
0,Afghanistan,0,0,low,AS,0,1
1,Albania,89,132,low,EU,0,1
2,Andorra,245,138,high,EU,1,0
3,Angola,217,57,low,AF,0,1
4,Antigua & Barbuda,102,128,low,NoA,0,1

In [11]:
df.to_csv('practice2.csv', index=False)